
  #### plan-nodes-20251124T024908.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tiles-test.onepassword_item.kubeconfig[0] will be created
  + resource "onepassword_item" "kubeconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-kubeconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.tiles-test.talos_cluster_kubeconfig.this[0] will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdnZLVm5nRWhRQ3MyS1BNQ1VoM1htakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNVEV4TVRneE1EUXlXaGNOTXpVeE1UQTVNVGd4TURReVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUdNdCszeW1LR3o3K0ZlVDk5NUQzMnNrSzZFaDNoVE96SFJpCm9XcUpNZkM4bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkZOb3UvK2w5R0liUXhLTQpCVWU3eTRuQkxyTE1NQVVHQXl0bGNBTkJBR2phSm5VdkxBY2RIZU95Qi9vVjJGQW41ckZiTVJOZXp0b1FoUk5FCk9seGEwaHVhNUJaWGdSeFZETmt0TjZMTWJnUU1DNVlQY0NtYVZFWExScS94eEFrPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJpRk1Ud3BEU29yM1FOYnhIZXZ0SUlNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNVEV4T0RFd05ESmFGdzB5TmpFeE1URXhPREV3TkRKYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTdhOHpIVzlUL0o1V2x0OHNBcWNQeUN3ak14L2RxQVNrCmJzdnlrSGdaSGc2alNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCUlRhTHYvcGZSaUcwTVNqQVZIdTh1SndTNnl6REFGQmdNclpYQURRUURzSHR4NQpkUmVkY1FCTExJcHBCeWFjWVovbGtpTk1ObHlHT3RxZkk1Nm5aS0tmZ29VN1RaRFVHVk9oV3AvZnUwak5EQUZGCjlhZWYyUEpud2JVa1VQSUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + endpoint                        = "10.0.192.11"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "10.0.192.11"
    }

  # module.tiles-test.talos_machine_bootstrap.this[0] will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBdnZLVm5nRWhRQ3MyS1BNQ1VoM1htakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNVEV4TVRneE1EUXlXaGNOTXpVeE1UQTVNVGd4TURReVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUdNdCszeW1LR3o3K0ZlVDk5NUQzMnNrSzZFaDNoVE96SFJpCm9XcUpNZkM4bzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkZOb3UvK2w5R0liUXhLTQpCVWU3eTRuQkxyTE1NQVVHQXl0bGNBTkJBR2phSm5VdkxBY2RIZU95Qi9vVjJGQW41ckZiTVJOZXp0b1FoUk5FCk9seGEwaHVhNUJaWGdSeFZETmt0TjZMTWJnUU1DNVlQY0NtYVZFWExScS94eEFrPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJpRk1Ud3BEU29yM1FOYnhIZXZ0SUlNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNVEV4T0RFd05ESmFGdzB5TmpFeE1URXhPREV3TkRKYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTdhOHpIVzlUL0o1V2x0OHNBcWNQeUN3ak14L2RxQVNrCmJzdnlrSGdaSGc2alNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCUlRhTHYvcGZSaUcwTVNqQVZIdTh1SndTNnl6REFGQmdNclpYQURRUURzSHR4NQpkUmVkY1FCTExJcHBCeWFjWVovbGtpTk1ObHlHT3RxZkk1Nm5aS0tmZ29VN1RaRFVHVk9oV3AvZnUwak5EQUZGCjlhZWYyUEpud2JVa1VQSUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + endpoint             = "10.0.192.11"
      + id                   = (known after apply)
      + node                 = "10.0.192.11"
    }

  # module.tiles-test.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Control - 7411 - tiles-test-cp - 10.0.192.11"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-cp"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7411

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = "local:iso/talos-test-1.11.5.iso"
          + interface = "ide2"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 3000
          + floating       = 3000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:11"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.tiles-test.module.talos-vm["tiles-test-cp"].talos_machine_configuration_apply.this[0] will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + endpoint                    = "10.0.192.11"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.192.11"
    }

  # module.tiles-test.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7421 - tiles-test-wk - 10.0.192.21"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-wk"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7421

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = "local:iso/talos-test-1.11.5.iso"
          + interface = "ide2"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 11000
          + floating       = 11000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:21"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.tiles-test.module.talos-vm["tiles-test-wk"].talos_machine_configuration_apply.this[0] will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + endpoint                    = "10.0.192.21"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.192.21"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  